spec/soap_data/move_folder_request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2010_SP2"/>
  </soap:Header>
  <soap:Body>
    <MoveFolder xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
      <m:ToFolderId>
        <t:FolderId Id="dest_folder_id"/>
      </m:ToFolderId>
      <m:FolderIds>
        <t:FolderId Id="src_folder_id"/>
      </m:FolderIds>
    </MoveFolder>
  </soap:Body>
</soap:Envelope>
